trunk/projects/alpine/prototype/M32/test/java/files/alpine/soap/valid/wsa/wsa-ws-transfer-message.xml

<s:Envelope
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:xxx="http://fabrikam123.example.com/resource-model">
  <!-- from http://www.w3.org/Submission/2006/04/ -->
  <s:Header>
    <wsa:ReplyTo>
      <wsa:Address>
        soap://www.fabrikam123.example.org/sender
      </wsa:Address>
    </wsa:ReplyTo>
    <wsa:To>soap://www.example.org/pushport</wsa:To>
    <xxx:CustomerID>732199</xxx:CustomerID>
    <xxx:Region>EMEA</xxx:Region>
    <wsa:Action>
      http://schemas.xmlsoap.org/ws/2004/09/transfer/Put
    </wsa:Action>
    <wsa:MessageID>
      uuid:00000000-0000-0000-C000-000000000047
    </wsa:MessageID>
  </s:Header>
  <s:Body>
    <xxx:Customer>
      <xxx:first>Roy</xxx:first>
      <xxx:last>Hill</xxx:last>
      <xxx:address>321 Main Street</xxx:address>
      <xxx:city>Manhattan Beach</xxx:city>
      <xxx:state>CA</xxx:state>
      <xxx:zip>90266</xxx:zip>
    </xxx:Customer>
  </s:Body>
</s:Envelope>